Tesla/load_test/output.txt
{
  "aggregate": {
    "counters": {
      "vusers.created_by_name.pdfwatermark": 1,
      "vusers.created": 1,
      "http.requests": 1,
      "http.codes.200": 1,
      "http.responses": 1,
      "http.downloaded_bytes": 3167215,
      "vusers.failed": 0,
      "vusers.completed": 1
    },
    "rates": {
      "http.request_rate": 1
    },
    "firstCounterAt": 1688956528297,
    "firstHistogramAt": 1688956531358,
    "lastCounterAt": 1688956531366,
    "lastHistogramAt": 1688956531366,
    "firstMetricAt": 1688956528297,
    "lastMetricAt": 1688956531366,
    "period": 1688956530000,
    "summaries": {
      "http.response_time": {
        "min": 3017,
        "max": 3017,
        "count": 1,
        "p50": 3011.6,
        "median": 3011.6,
        "p75": 3011.6,
        "p90": 3011.6,
        "p95": 3011.6,
        "p99": 3011.6,
        "p999": 3011.6
      },
      "vusers.session_length": {
        "min": 3069.6,
        "max": 3069.6,
        "count": 1,
        "p50": 3072.4,
        "median": 3072.4,
        "p75": 3072.4,
        "p90": 3072.4,
        "p95": 3072.4,
        "p99": 3072.4,
        "p999": 3072.4
      }
    },
    "histograms": {
      "http.response_time": {
        "min": 3017,
        "max": 3017,
        "count": 1,
        "p50": 3011.6,
        "median": 3011.6,
        "p75": 3011.6,
        "p90": 3011.6,
        "p95": 3011.6,
        "p99": 3011.6,
        "p999": 3011.6
      },
      "vusers.session_length": {
        "min": 3069.6,
        "max": 3069.6,
        "count": 1,
        "p50": 3072.4,
        "median": 3072.4,
        "p75": 3072.4,
        "p90": 3072.4,
        "p95": 3072.4,
        "p99": 3072.4,
        "p999": 3072.4
      }
    }
  },
  "intermediate": [
    {
      "counters": {
        "vusers.created_by_name.pdfwatermark": 1,
        "vusers.created": 1,
        "http.requests": 1
      },
      "rates": {
        "http.request_rate": 1
      },
      "http.request_rate": null,
      "firstCounterAt": 1688956528297,
      "lastCounterAt": 1688956528310,
      "firstMetricAt": 1688956528297,
      "lastMetricAt": 1688956528310,
      "period": "1688956520000",
      "summaries": {},
      "histograms": {}
    },
    {
      "counters": {
        "http.codes.200": 1,
        "http.responses": 1,
        "http.downloaded_bytes": 3167215,
        "vusers.failed": 0,
        "vusers.completed": 1
      },
      "rates": {},
      "firstCounterAt": 1688956531358,
      "firstHistogramAt": 1688956531358,
      "lastCounterAt": 1688956531366,
      "lastHistogramAt": 1688956531366,
      "firstMetricAt": 1688956531358,
      "lastMetricAt": 1688956531366,
      "period": "1688956530000",
      "summaries": {
        "http.response_time": {
          "min": 3017,
          "max": 3017,
          "count": 1,
          "p50": 3011.6,
          "median": 3011.6,
          "p75": 3011.6,
          "p90": 3011.6,
          "p95": 3011.6,
          "p99": 3011.6,
          "p999": 3011.6
        },
        "vusers.session_length": {
          "min": 3069.6,
          "max": 3069.6,
          "count": 1,
          "p50": 3072.4,
          "median": 3072.4,
          "p75": 3072.4,
          "p90": 3072.4,
          "p95": 3072.4,
          "p99": 3072.4,
          "p999": 3072.4
        }
      },
      "histograms": {
        "http.response_time": {
          "min": 3017,
          "max": 3017,
          "count": 1,
          "p50": 3011.6,
          "median": 3011.6,
          "p75": 3011.6,
          "p90": 3011.6,
          "p95": 3011.6,
          "p99": 3011.6,
          "p999": 3011.6
        },
        "vusers.session_length": {
          "min": 3069.6,
          "max": 3069.6,
          "count": 1,
          "p50": 3072.4,
          "median": 3072.4,
          "p75": 3072.4,
          "p90": 3072.4,
          "p95": 3072.4,
          "p99": 3072.4,
          "p999": 3072.4
        }
      }
    }
  ]
}