Tesla/load_test/output.txt
{
  "aggregate": {
    "counters": {
      "vusers.created_by_name.pdfwatermark": 1,
      "vusers.created": 1,
      "http.requests": 1,
      "http.codes.200": 1,
      "http.responses": 1,
      "http.downloaded_bytes": 3167216,
      "vusers.failed": 0,
      "vusers.completed": 1
    },
    "rates": {
      "http.request_rate": 1
    },
    "firstCounterAt": 1688749419363,
    "firstHistogramAt": 1688749419531,
    "lastCounterAt": 1688749419537,
    "lastHistogramAt": 1688749419537,
    "firstMetricAt": 1688749419363,
    "lastMetricAt": 1688749419537,
    "period": 1688749410000,
    "summaries": {
      "http.response_time": {
        "min": 120,
        "max": 120,
        "count": 1,
        "p50": 120.3,
        "median": 120.3,
        "p75": 120.3,
        "p90": 120.3,
        "p95": 120.3,
        "p99": 120.3,
        "p999": 120.3
      },
      "vusers.session_length": {
        "min": 174,
        "max": 174,
        "count": 1,
        "p50": 172.5,
        "median": 172.5,
        "p75": 172.5,
        "p90": 172.5,
        "p95": 172.5,
        "p99": 172.5,
        "p999": 172.5
      }
    },
    "histograms": {
      "http.response_time": {
        "min": 120,
        "max": 120,
        "count": 1,
        "p50": 120.3,
        "median": 120.3,
        "p75": 120.3,
        "p90": 120.3,
        "p95": 120.3,
        "p99": 120.3,
        "p999": 120.3
      },
      "vusers.session_length": {
        "min": 174,
        "max": 174,
        "count": 1,
        "p50": 172.5,
        "median": 172.5,
        "p75": 172.5,
        "p90": 172.5,
        "p95": 172.5,
        "p99": 172.5,
        "p999": 172.5
      }
    }
  },
  "intermediate": [
    {
      "counters": {
        "vusers.created_by_name.pdfwatermark": 1,
        "vusers.created": 1,
        "http.requests": 1,
        "http.codes.200": 1,
        "http.responses": 1,
        "http.downloaded_bytes": 3167216,
        "vusers.failed": 0,
        "vusers.completed": 1
      },
      "rates": {
        "http.request_rate": 1
      },
      "http.request_rate": null,
      "firstCounterAt": 1688749419363,
      "firstHistogramAt": 1688749419531,
      "lastCounterAt": 1688749419537,
      "lastHistogramAt": 1688749419537,
      "firstMetricAt": 1688749419363,
      "lastMetricAt": 1688749419537,
      "period": "1688749410000",
      "summaries": {
        "http.response_time": {
          "min": 120,
          "max": 120,
          "count": 1,
          "p50": 120.3,
          "median": 120.3,
          "p75": 120.3,
          "p90": 120.3,
          "p95": 120.3,
          "p99": 120.3,
          "p999": 120.3
        },
        "vusers.session_length": {
          "min": 174,
          "max": 174,
          "count": 1,
          "p50": 172.5,
          "median": 172.5,
          "p75": 172.5,
          "p90": 172.5,
          "p95": 172.5,
          "p99": 172.5,
          "p999": 172.5
        }
      },
      "histograms": {
        "http.response_time": {
          "min": 120,
          "max": 120,
          "count": 1,
          "p50": 120.3,
          "median": 120.3,
          "p75": 120.3,
          "p90": 120.3,
          "p95": 120.3,
          "p99": 120.3,
          "p999": 120.3
        },
        "vusers.session_length": {
          "min": 174,
          "max": 174,
          "count": 1,
          "p50": 172.5,
          "median": 172.5,
          "p75": 172.5,
          "p90": 172.5,
          "p95": 172.5,
          "p99": 172.5,
          "p999": 172.5
        }
      }
    }
  ]
}